
# PSI表格
psi_detail = {
    # 列名
    #             区间      Actual%    Expected%   PSI
    "header": ["interval", "actual", "expected", "psi"],
    # 标签（用于下拉框）
    "label": ["x1", "y"],  # 可能有多个
    "x1": [
        # 表格数据，按行排列
        ["[0.0, 0.2)", 0.23, 0.2, 0.21],
        ["[0.2, 0.4)", 0.19, 0.25, 0.22],
        ["[0.4, 0.6)", 0.22, 0.15, 0.19],
        ["[0.6, 0.8)", 0.17, 0.1, 0.14],
        ["[0.8, 1.0)", 0.18, 0.2, 0.19]
    ],
    "y": [
        ["0", 0.6, 0.7, 0.65],
        ["1", 0.4, 0.3, 0.35]
    ]
}

# PSI柱状图
psi_chart = {
    # 用于"标签"下拉框
    "features": ["x1", "y"],  # 可能有多个
    "xAxis": {
        "name": "interval",  # 区间
        "data": {
            "x1": ["[0.0, 0.2)", "[0.2, 0.4)", "[0.4, 0.6)", "[0.6, 0.8)", "[0.8, 1.0)"],
            "y": ["0", "1"],
        }
    },
    "yAxis": {
        "name": {
            "expected": "bar",  # 条形
            "actual": "bar",
            'psi': 'curve'  # 曲线
        },
        "data": {
            "x1_expected": [0.2, 0.25, 0.15, 0.1, 0.2],
            "x1_actual": [0.23, 0.19, 0.22, 0.17, 0.18],
            "x1_psi": [0.21, 0.22, 0.19, 0.14, 0.19],
            "y_expected": [0.6, 0.4],
            "y_actual": [0.7, 0.3],
            "y_psi": [0.65, 0.35]
        }
    }
}
